cmsis-svd/cmsis-svd/data/Spansion/MB9BF52xL.svd
        <!-- REGISTER "IRQCMODE" -->
        <register>
          <name>IRQCMODE</name>
          <description>Interrupt Factor Vector Relocate Setting Register </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQCMODE" -->
            <field>
              <name>IRQCMODE</name>
              <description>Interrupt Factor Vector Relocate Setting</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EXC02MON" -->
        <register>
          <name>EXC02MON</name>
          <description>EXC02 batch read register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HWINT" -->
            <field>
              <name>HWINT</name>
              <description>Hardware watchdog timer interrupt request</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMI" -->
            <field>
              <name>NMI</name>
              <description>External NMIX pin interrupt request </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ00MON" -->
        <register>
          <name>IRQ00MON</name>
          <description>IRQ00 Batch Read Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCSINT" -->
            <field>
              <name>FCSINT</name>
              <description>Anomalous frequency detection by CSV interrupt request </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ01MON" -->
        <register>
          <name>IRQ01MON</name>
          <description>IRQ01 Batch Read Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWWDTINT" -->
            <field>
              <name>SWWDTINT</name>
              <description>Software watchdog timer interrupt request </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ02MON" -->
        <register>
          <name>IRQ02MON</name>
          <description>IRQ02 Batch Read Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDINT" -->
            <field>
              <name>LVDINT</name>
              <description>Low voltage detection (LVD) interrupt request </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ03MON" -->
        <register>
          <name>IRQ03MON</name>
          <description>IRQ03 Batch Read Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WAVE0INT3" -->
            <field>
              <name>WAVE0INT3</name>
              <description>WFG timer 54 interrupt request in MFT unit 0 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVE0INT2" -->
            <field>
              <name>WAVE0INT2</name>
              <description>WFG timer 32 interrupt request in MFT unit 0 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVE0INT1" -->
            <field>
              <name>WAVE0INT1</name>
              <description>WFG timer 10 interrupt request in MFT unit 0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAVE0INT0" -->
            <field>
              <name>WAVE0INT0</name>
              <description>DTIF (motor emergency stop) interrupt request in MFT unit 0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ04MON" -->
        <register>
          <name>IRQ04MON</name>
          <description>IRQ04 Batch Read Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT7" -->
            <field>
              <name>EXTINT7</name>
              <description>Interrupt request on external interrupt ch.7</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT6" -->
            <field>
              <name>EXTINT6</name>
              <description>Interrupt request on external interrupt ch.6</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT5" -->
            <field>
              <name>EXTINT5</name>
              <description>Interrupt request on external interrupt ch.5</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT4" -->
            <field>
              <name>EXTINT4</name>
              <description>Interrupt request on external interrupt ch.4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT3" -->
            <field>
              <name>EXTINT3</name>
              <description>Interrupt request on external interrupt ch.3</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT2" -->
            <field>
              <name>EXTINT2</name>
              <description>Interrupt request on external interrupt ch.2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT1" -->
            <field>
              <name>EXTINT1</name>
              <description>Interrupt request on external interrupt ch.1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT0" -->
            <field>
              <name>EXTINT0</name>
              <description>Interrupt request on external interrupt ch.0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ05MON" -->
        <register>
          <name>IRQ05MON</name>
          <description>IRQ05 Batch Read Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT14" -->
            <field>
              <name>EXTINT14</name>
              <description>Interrupt request on external interrupt ch.22</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT13" -->
            <field>
              <name>EXTINT13</name>
              <description>Interrupt request on external interrupt ch.21</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT12" -->
            <field>
              <name>EXTINT12</name>
              <description>Interrupt request on external interrupt ch.20</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT11" -->
            <field>
              <name>EXTINT11</name>
              <description>Interrupt request on external interrupt ch.19</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT10" -->
            <field>
              <name>EXTINT10</name>
              <description>Interrupt request on external interrupt ch.18</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT9" -->
            <field>
              <name>EXTINT9</name>
              <description>Interrupt request on external interrupt ch.17</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT8" -->
            <field>
              <name>EXTINT8</name>
              <description>Interrupt request on external interrupt ch.16</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT7" -->
            <field>
              <name>EXTINT7</name>
              <description>Interrupt request on external interrupt ch.15</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT6" -->
            <field>
              <name>EXTINT6</name>
              <description>Interrupt request on external interrupt ch.14</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT5" -->
            <field>
              <name>EXTINT5</name>
              <description>Interrupt request on external interrupt ch.13</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT4" -->
            <field>
              <name>EXTINT4</name>
              <description>Interrupt request on external interrupt ch.12</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ06MON" -->
        <register>
          <name>IRQ06MON</name>
          <description>IRQ06 Batch Read Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QUD1INT5" -->
            <field>
              <name>QUD1INT5</name>
              <description>PC match and RC match interrupt request on QPRC ch.1 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT4" -->
            <field>
              <name>QUD1INT4</name>
              <description>Interrupt request detected RC out of range on QPRC ch.1 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT3" -->
            <field>
              <name>QUD1INT3</name>
              <description>PC count invert interrupt request on QPRC ch.1 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT2" -->
            <field>
              <name>QUD1INT2</name>
              <description>Overflow/underflow/zero index interrupt request on QPRC ch.1 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT1" -->
            <field>
              <name>QUD1INT1</name>
              <description>PC and RC match interrupt request on QPRC ch.1 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD1INT0" -->
            <field>
              <name>QUD1INT0</name>
              <description>PC match interrupt request on QPRC ch.1 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT5" -->
            <field>
              <name>QUD0INT5</name>
              <description>PC match and RC match interrupt request on QPRC ch.0</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT4" -->
            <field>
              <name>QUD0INT4</name>
              <description>Interrupt request detected RC out of range on QPRC ch.0</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT3" -->
            <field>
              <name>QUD0INT3</name>
              <description>PC count invert interrupt request on QPRC ch.0</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT2" -->
            <field>
              <name>QUD0INT2</name>
              <description>Overflow/underflow/zero index interrupt request on QPRC ch.0</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT1" -->
            <field>
              <name>QUD0INT1</name>
              <description>PC and RC match interrupt request on QPRC ch.0</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QUD0INT0" -->
            <field>
              <name>QUD0INT0</name>
              <description>PC match interrupt request on QPRC ch.0</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TIMINT2" -->
            <field>
              <name>TIMINT2</name>
              <description>Dual timer 2 interrupt request </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TIMINT1" -->
            <field>
              <name>TIMINT1</name>
              <description>Dual timer 1 interrupt request </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
